import re
import Utils.logger as logger

mainlogger = logger.getLogger('main')

# 算法常量与对应标志位
# 标志位  即  算法在algorithm_init中的位数
datamap = {'3': '2',
           '0': '5',
           '1': '3',  # 摔倒
           '7': '1',
           '6': '6',
           '5': '7',
           '4': '8',
           '9': '26',
           '10': '25',
           '11': '27',
           '12': '29',
           '13': '30',
           '14': '24',
           '15': '23',
           '16': '19',
           '18': '15',  # 单人作业
           '22': '33',
           '24': '32',
           '23': '34',
           '36': '99',
           '19': '103',
           '31': '102',
           '32': '100',
           '27': '13',  # 攀爬
           '28': '104',  # 举手过肩
           '29': '124',  # 烟火识别
           '33': '28',  # 挖掘机
           '34': '146',  # 摄像机遮挡
           '39': '107',  # 斗殴
           '40': '108',
           '52': '109',
           '37': '111',
           '51': '112',
           '50': '113',
           '49': '114',
           '48': '115',
           '47': '116',
           '46': '117',
           '45': '118',
           '43': '14',  # 拥挤
           '59': '119',
           '60': '120',
           '61': '121',
           '58': '122',
           '56': '123',
           '54': '125',
           '57': '126',
           '55': '127',
           '63': '136',  # 访客工衣
           '64': '2611',  # 烟雾
           '66': '133',  # 下蹲
           '67': '132',  # 弯腰
           '68': '131',  # 跨越
           '70': '128',  # 人流密度
           '79': '142',  # 猫狗识别
           '78': '143',  # 吃饭行为
           '77': '144',  # 移动侦测
           '76': '145',  # 亮斑识别
           '75': '151',  # 婴儿啼哭
           '74': '152',  # 打针行为
           '73': '153',  # 吃药行为
           '72': '154',  # 遗留物(桶)
           }

modelnamemap = {'1': '入侵',
                '2': '手持板砖',
                '3': '摔倒',
                '5': '尾随',
                '6': '手持刀',
                '7': '手持枪',
                '8': '手持棍棒',
                '13': '攀爬',  # 暂定攀爬算法常量为13，之后随平台修改
                '14': '人员聚集',
                '15': '单人作业',
                '26': '未戴绝缘手套',
                '25': '未戴工作手套',
                '27': '未穿反光背心',
                '28': '挖掘机',
                '29': '短袖工作服',
                '30': '未扣紧衣服',
                '24': '系好安全带',
                '23': '未佩戴安全绳',
                '19': '未戴作业安全帽',
                '33': '未戴防护面罩',
                '32': '未穿绝缘鞋',
                '31': '未穿防滑鞋',
                '34': '护目镜',
                '99': '拍照',
                '103': '人脸特征',
                '102': '无布控任务',
                '100': '有布控任务',
                '104': '举手过肩',
                '105': '热成像高温预警',
                '107': '斗殴',
                '108': '人流量统计',
                '109': '拨打手机',
                '111': '手持手机',
                '112': '抽烟',
                '113': '睡岗',
                '114': '离岗',
                '115': '手扶扶手',
                '116': '电动自行车',
                '117': '推车穿反光衣',
                '118': '电动车头盔',
                '119': '手持杯子',
                '120': '按道通行',
                '121': '工作帽',
                '122': '奔跑',
                '123': '未穿工作服',
                '124': '烟火识别',
                '125': '未穿反光衣',
                '126': '未穿围裙',
                '127': '未穿厨师帽',
                '128': '人流量密度',
                '131': '跨越',
                '132': '弯腰',
                '133': '蹲下',
                '136': '未穿访客工衣',
                '2611': '烟雾报警',
                '142': '猫狗识别',
                '143': '吃饭行为',
                '144': '移动侦测',
                '145': '亮斑识别',
                '151': '婴儿行为',
                '152': '打针行为',
                '153': '吃药行为',
                '154': '遗留物'
                }

framemap = {
    "1010": "1",
    "1051": "2", "1052": "2",
    "1070": "3",
    "1080": "5",
    "1021": "6", "1022": "6",
    "1031": "7", "1032": "7",
    "1041": "8", "1042": "8",
    '11610': '26', '11611': '26', '11620': '26', '11621': '26',
    '11510': '25', '11511': '25', '11520': '25', '11521': '25',
    '1141': '27',
    '1130': '29', '1131': '29',
    '1121': '30',
    '1100': '23',
    '1110': '24',
    '1090': '19', '1091': '19',
    '11810': '32', '11811': '32', '11820': '32', '11821': '32',
    '11710': '31', '11711': '31', '11720': '31', '11721': '31',
    '1200': '33', '1201': '33',
    '1190': '34', '1191': '34',
    '1400': '99',
    '1230': '103',
    '1240': '15',
    '1250': '146',
    '1280': '102',
    '1260': '28',
    '1270': '100',
    '1300': '124',
    '1310': '104',
    '1320': '13',
    '1330': '14',
    '1370': '107',
    '1360': '108',
    '1410': '109',
    '1390': '111', '1391': '111',
    '1420': '112',
    '1430': '113',
    '1440': '114',
    '1450': '115',
    '1460': '116',
    '1470': '117',
    '1480': '118',
    '1500': '120',
    '1490': '121',
    '1540': '123',
    '1530': '126',
    '1550': '127',
    '1570': '128',
    '1590': '131',
    '1600': '132',
    '1610': '133',
    '1630': '2611',
    '1640': '136',
    '1650': '142',
    '1660': '143',
    '1670': '144',
    '1680': '145',
    '1690': '151',
    '1700': '152',
    '1710': '153',
    '1720': '154',

}

algorithm_init = "00000000 00000000 00000000 00000000 00000000 00000000 00000000 00000000 00000000"


def get_algorithm_num(algorithm):
    print('-----------', algorithm)
    result = []
    # algorithm = algorithm.replace(" ","")
    list = [m.start() for m in re.finditer('1', algorithm)]
    for res in list:
        result.append(datamap[str(res + 1)])
    return result


def get_key(d, value):
    try:
        k = [k for k, v in d.items() if v == value]
    except:
        return None
    return k


def constant_to_str(constant_list: list, alg_init=algorithm_init):
    '''
    算法常量转为64位字符串
    '''
    try:
        algorithm_str = list(alg_init)
        constant_type = type(constant_list)
        if constant_type == list:
            for item in constant_list:
                x = get_key(datamap, item)
                if not x:
                    continue
                algorithm_str[int(x[0])] = '1'
        elif constant_type == str:
            x = get_key(datamap, constant_list)
            if not x:
                return
            algorithm_str[int(x[0])] = '1'
    except Exception as e:
        mainlogger.info('Error : %s;\n constant list : %s;' % (e, constant_list,))
        return None
    return ''.join(algorithm_str)


def Identifier_to_constant(identifier: str):
    '''
    识别码转换到算法常量；
    '''
    constant_num = framemap[identifier]
    return constant_num
